Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱིད་ལ། ཆོས་དེ་དག་ཀྱང་མ་མཆིས་ཤིང་མི་དམིགས་པས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་འབྱུང་བར་དཀའོ།
en: Then those gods inhabiting the realm of desire and the realm of form said to the Blessed One, “Blessed Lord, unsurpassed, complete enlightenment is hard to manifest because bodhisattva great beings should indeed attain consummate buddhahood with respect to all phenomena, and yet all those phenomena are indeed nonexistent and unapprehended.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་བུ་དག་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: Divine princes, it is so! It is so!” replied the Blessed One. “

source: ལྷའི་བུ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་འབྱུང་བར་དཀའོ།
en: Divine princes, unsurpassed, complete enlightenment is hard to manifest.

source: །ལྷའི་བུ་དག་ངས་ཀྱང་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། དོན་དམ་པར་ན་གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའམ།
en: Divine princes, I have indeed attained consummate buddhahood with respect to all phenomena and in all ways.

source: གང་གིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའམ། གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བའི་ཆོས་གང་ཡང་མི་དམིགས་སོ།
en: Ultimately, however, there is nothing at all that is apprehended with respect to which I would attain manifest perfect buddhahood, or by which I would attain manifest perfect buddhahood, or on the basis of which I should attain consummate buddhahood. {

source: ལྷའི་བུ་དག་ཆོས་ཐམས་ཅད་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: IV: 130} If you ask why, divine princes, it is because all phenomena are absolutely pure.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་གང་འདི་སྐད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་འབྱུང་བར་དཀའོ་ཞེས་གསུངས་པ།
en: Then the venerable Subhūti said to the Blessed One, “Blessed Lord, you have just said that unsurpassed, complete enlightenment is hard to manifest.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟར་གསུངས་པའི་དོན་བདག་གིས་འཚལ་བ་དང་། བདག་སེམས་པ་ལྟར་ན་བཅོམ་ལྡན་འདས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི་བར་ནི་མི་དཀའོ།
en: As far as I understand and ponder the meaning of the words spoken by the Blessed One, it is not difficult, Blessed Lord, to attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་གང་ཡང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་མཆིས། གང་གིས་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་མཆིས། གང་ཡང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི་བ་མ་མཆིས་ཏེ།
en: If one were to ask why, Blessed Lord, it is because there is nothing at all with respect to which consummate buddhahood would be attained, there is nothing by which consummate buddhahood would be attained, and there is nothing on the basis of which consummate buddhahood would be attained.

source: ཆོས་ཐམས་ཅད་ནི་སྟོང་པའོ།
en: All dharmas are empty.

source: །ཆོས་ཐམས་ཅད་སྟོང་པ་ལ་ནི་གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། གང་གིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི་བའི་ཆོས་དེ་ལྟ་བུ་མ་མཆིས་སོ།
en: All dharmas being empty, any such thing with respect to which consummate buddhahood would be attained, anything by which consummate buddhahood would be attained, and anything on the basis of which consummate buddhahood would be attained is nonexistent. “

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་སྟེ། ཆོས་གང་འཕེལ་བར་བགྱི་བའམ། ཡོངས་སུ་འགྲིབ་པར་བགྱི་བའི་སླད་དུ་སྦྱིན་པ་ཡོངས་སུ་གཏང་བའམ། ཚུལ་ཁྲིམས་བསྲུང་བ་འམ། བཟོད་པ་བསྒོམ་པའམ། བརྩོན་འགྲུས་བརྩམ་པའམ། བསམ་གཏན་ལ་མཉམ་པར་གཞག་པའམ། ཤེས་རབ་བསྒོམ་པའམ། ནང་སྟོང་པ་ཉིད་བསྒོམ་པའམ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་བསྒོམ་པ་འམ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་བསྒོམ་པ་འམ། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་།
en: If one were to ask why, Blessed Lord, it is because all dharmas are empty.

source: སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྒོམ་པའམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་བསྒོམ་པའམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་དོན་དུ་བསླབ་པར་བགྱི་བའི་ཆོས་དེ་དག་ཀྱང་མ་མཆིས་པ་སྟེ།
en: All the dharmas to enhance or reduce which they dispense generosity, maintain ethical discipline, cultivate tolerance, undertake perseverance, become absorbed in meditative concentration, and cultivate wisdom; cultivate the emptiness of internal phenomena; cultivate [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; cultivate the applications of mindfulness; cultivate the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path; cultivate [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas; or cultivate [all the goals], up to and including all-aspect omniscience, are nonexistent.

source: གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའམ། གང་གིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའམ། གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱང་སྟོང་པ་སྟེ།
en: All those dharmas with respect to which consummate buddhahood would be attained, by which consummate buddhahood would be attained, and on the basis of which consummate buddhahood would be attained are indeed empty. “

source: བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་སླའོ།
en: Blessed Lord, for this reason, it would be easy for bodhisattva great beings to attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་གཟུགས་ནི་གཟུགས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: If one were to ask why, Blessed Lord, it is because physical forms are empty of their own essential nature.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་ཤེས་པའི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: Feelings, perceptions, formative predispositions, and consciousness are empty of their own essential nature.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ནི། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: The sense fields, sensory elements, and links of dependent origination are empty of their own essential nature.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་ངོ་། །འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: All the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are empty of their own essential nature.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas are empty of their own essential nature. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱིས་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: The goals], up to and including all-aspect omniscience, are empty of their own essential nature.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་རྣམ་གྲངས་དེས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་དཀའ་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Then, the venerable Śāradvatīputra addressed the venerable Subhūti as follows: “Venerable Subhūti, it is for this very reason that it is difficult to attain consummate buddhahood in unsurpassed, complete enlightenment.

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ནམ་མཁའ་ནི་འདི་སྙམ་དུ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ་སྙམ་དུ་མི་སེམས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་འདི་སྙམ་དུ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ་སྙམ་དུ་མི་སེམས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If you ask why, Venerable Subhūti, just as space does not entertain the thought, ‘I must attain consummate buddhahood in unsurpassed, complete enlightenment,’ in the same way, Venerable Subhūti, bodhisattva great beings also do not entertain the thought, ‘I should attain consummate buddhahood in unsurpassed, complete enlightenment.’

source: དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཉམ་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because all phenomena are the same as space. {Ki.

source: འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཆོས་ཐམས་ཅད་ནམ་མཁའ་ལྟ་བུར་མོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: IV: 131} And yet, once bodhisattva great beings accept that all phenomena resemble space, they will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ནམ་མཁའ་ལྟ་བུར་མོས་པར་མི་བྱེད་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་སླ་སྟེ། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་དཀའ་བ་མེད་ན་ནི། བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་པར་ཡང་མི་འགྱུར་རོ།
en: If, even in the case of bodhisattva great beings who do not accept that all phenomena resemble space, it were easy for them to attain consummate buddhahood in unsurpassed, complete enlightenment, and it were easy to attain consummate enlightenment, and it were not difficult for them to attain consummate buddhahood, then bodhisattvas, numerous as the grains of sand of the river Gaṅgā, would make irreversible progress toward unsurpassed, complete enlightenment.

source: །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་རྣམ་གྲངས་དེས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ནི་དཀའ་སྟེ།
en: For this reason, Venerable Subhūti, it is difficult to attain consummate buddhahood in unsurpassed, complete enlightenment.

source: མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་སླ་བ་མ་ཡིན་པར་ཤེས་སོ།
en: One can discern that it is not easy to attain consummate buddhahood.”

source: །རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། གཟུགས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ།
en: Subhūti then asked, “Venerable Śāradvatīputra, do you think that physical forms regress from unsurpassed, complete enlightenment?” “

source: སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ།
en: No, Venerable Subhūti!”

source: །སྨྲས་པ་འོ་ན་ཅི་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ།
en: he replied. “Do feelings, perceptions, formative predispositions, and consciousness regress from unsurpassed, complete enlightenment?” “

source: སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ། །སྨྲས་པ། འོ་ན་ཅི་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙ
en: No, Venerable Subhūti!” “

source: མ་དུ་སེམས། སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ།
en: Well then, Venerable Śāradvatīputra, do you think that the sense fields, sensory elements, links of dependent origination, all the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas regress from unsurpassed, complete enlightenment?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ། སྨྲས་པ།
en: Do [the goals], up to and including all-aspect omniscience, regress from unsurpassed, complete enlightenment?” “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ། །སྨྲས་པ།
en: No, Venerable Subhūti!” “

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། གཟུགས་ལས་གུད་ན་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་པའི་ཆོས་དེ་ལྟ་བུ་དམིགས་སམ། སྨྲས་པ།
en: Venerable Śāradvatīputra, do you think that one might apprehend anything other than physical forms that regresses from unsurpassed, complete enlightenment?” “

source: འོ་ན་ཅི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལས་གུད་ན། གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་པའི་ཆོས་དེ་ལྟ་བུ་དམིགས་སམ།
en: Well then, can one apprehend anything other than feelings, perceptions, formative predispositions, and consciousness that regresses from unsurpassed, complete enlightenment?” “

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ། །སྨྲས་པ།
en: No, Venerable Subhūti!” “

source: འོ་ན་ཅི་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: Well then, can one apprehend anything other than the sense fields, the sensory elements, the links of dependent origination, all the perfections, all the aspects of emptiness the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, {Ki.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལས་གུད་ན་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་པའི་ཆོས་དེ་ལྟ་བུ་དམིགས་སམ།
en: IV: 132} the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, and [the goals], up to and including all-aspect omniscience, that regresses from unsurpassed, complete enlightenment?” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ།
en: Venerable Śāradvatīputra, do you think that the real nature of physical forms regresses from unsurpassed, complete enlightenment?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ།
en: Does the real nature of feelings, perceptions, formative predispositions, and consciousness regress from unsurpassed, complete enlightenment?

source: སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་།
en: Does the real nature of the sense fields, sensory elements, and the links of dependent origination regress from unsurpassed, complete enlightenment?

source: ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ།
en: Does the real nature of all the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas regress from unsurpassed, complete enlightenment?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ།
en: Does the real nature of [the goals], up to and including all-aspect omniscience, regress from unsurpassed, complete enlightenment?” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ལས་གུད་ན་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་པའི་ཆོས་དེ་ལྟ་བུ་ཡོད་དམ།
en: Venerable Śāradvatīputra, do you think that there is anything other than the real nature of physical forms that regresses from unsurpassed, complete enlightenment?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ལས་གུད་ན་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་པའི་ཆོས་དེ་ལྟ་བུ་ཡོད་དམ།
en: Is there anything other than the real nature of feelings, perceptions, formative predispositions, and consciousness that regresses from unsurpassed, complete enlightenment?

source: སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་ལས་གུད་ན་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་པའི་ཆོས་དེ་ལྟ་བུ་ཡོད་དམ། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: Is there anything other than the real nature of the sense fields, sensory elements, and links of dependent origination that regresses from unsurpassed, complete enlightenment?

source: མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་དེ་བཞིན་ཉིད་ལས་གུད་ན་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་པའི་ཆོས་དེ་ལྟ་བུ་ཡོད་དམ།
en: Is there anything other than the real nature of all the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas that regresses from unsurpassed, complete enlightenment?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་དེ་བཞིན་ཉིད་ལས་གུད་ན་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་པའི་ཆོས་དེ་ལྟ་བུ་ཡོད་དམ།
en: Is there anything other than the real nature of [the goals], up to and including all-aspect omniscience, that regresses from unsurpassed, complete enlightenment?” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་ཉིད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ།
en: Venerable Śāradvatīputra, do you think that the real nature regresses from unsurpassed, complete enlightenment?” {

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། ཆོས་ཉིད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ།
en: Venerable Śāradvatīputra, do you think that reality regresses from unsurpassed, complete enlightenment?

source: ཆོས་ཀྱི་དབྱིངས་དང་ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་གམ།
en: Do the realm of phenomena, the abiding nature of reality, the maturity with respect to all phenomena, the very limit of reality, and the inconceivable realm regress from unsurpassed, complete enlightenment?” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་ཉིད་ལས་གུད་ན་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་པའི་ཆོས་དེ་ལྟ་བུ་ཡོད་དམ།
en: Venerable Śāradvatīputra, do you think that there is anything other than the real nature that regresses from unsurpassed, complete enlightenment?” “

source: སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ། །སྨྲས་པ།
en: No, Venerable Subhūti!” “

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། ཆོས་ཉིད་དང་ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ལས་གུད་ན་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་པའི་ཆོས་དེ་ལྟ་བུ་ཡོད་དམ།
en: Venerable Śāradvatīputra, do you think that there is anything other than reality, the realm of phenomena, the abiding nature of reality, the maturity with respect to all phenomena, the very limit of reality, and the inconceivable realm that regresses from unsurpassed, complete enlightenment?” “

source: །སྨྲས་པ་དེ་ལྟར་བདེན་པའི་ཚུལ་བཞིན་དུ་ཆོས་དེ་དག་མི་དམིགས་ན། གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་པའི་ཆོས་དེ་ལྟ་བུ་གང་ཞིག་ཡོད།
en: So, if one cannot apprehend those phenomena as being truly established, what is that thing that regresses from unsurpassed, complete enlightenment?” “

source: སྨྲས་པ་གནས་བརྟན་རབ་འབྱོར་གྱིས་ཆོས་ཀྱི་ཚུལ་དང་རྣམ་པ་དེས་བསྟན་པ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་གང་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ལྡོག་པ་མེད་དེ།
en: According to this exposition of the elder Subhūti, which accords with the principle of [ultimate] reality and its aspects, there is no bodhisattva great being who regresses from unsurpassed, complete enlightenment.

source: དེ་ལྟར་ན་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་གསུམ་དེ་བཞིན་གཤེགས་པས་བསྟན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་གང་ཟག་གསུམ་པོ་དེ་དག་གི་བྱང་ཆུབ་རྣམ་པར་དགོད་པར་ཡང་མི་འགྱུར་ཏེ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་འདིས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་བསྟན་པ་ལྟར་ན། འདི་ལྟ་སྟེ།
en: If that is the case, there is no gradation into the [differing degrees of] enlightenment of the three kinds of person involved in the vehicle of the bodhisattvas—those whom the tathāgatas have taught as constituting the three kinds of person involved in the vehicle of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་གཅིག་པུར་འགྱུར་རོ།
en: According to the venerable Subhūti’s exposition of the vehicle of the bodhisattvas, bodhisattva great beings would become followers solely of the vehicle of the buddhas.”
